GetMonitoredLinkElementIds Method
 Provides the link instance IDs when the element is monitoring.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public IList<ElementId> GetMonitoredLinkElementIds()
  Visual Basic
Public Function GetMonitoredLinkElementIds As IList(Of ElementId)
  Visual C++
public:
IList<ElementId^>^ GetMonitoredLinkElementIds()
 Return Value
 The IDs of linked instances.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →